def extract(text: str) -> [['entity', 'standpoint']]:
    """
    根据文本提取人物言论
    :param text:
    :return:
    """
    # TODO
    return [['吴军',
             """腾讯从来没有过ToB的基因。前些天还跟一些朋友讲就说他们，做云计算的就一直堵在人家企业门口，
             甚至主动给人家企业先打个一百万进去，说你把数据迁移到我这里。发现他整个企业做这种服务是完全跟不上的，
             没有这个基因，你不用想，就像恐龙想去冰河时代生活。腾讯是一个对社会真是没有危害的公司，
             但是你说要带给大家多少惊喜，微信之后的我也真说不出来。"""],
            ['吴军',
             """今天的谷歌，这是一个颇为平庸的公司。虽然它搞出了一些很亮眼的技术，但对人的帮助来讲，它远不像过去那么大。过去有它和没它，
             世界是不一样的。就是说它最后一个对人类最大的贡献是安卓。在这安卓以后，说它又贡献了什么了不得的东西，我也想不出来对人（类）有关。
             它的管理很混乱，最典型的就是它的云计算的策略，你可以看到，这中间的换人，权利的斗争等等这些东西，多少而且有点丑。
             谷歌之所以说有时候发展不行，跟这个CEO（桑达尔˙皮查伊）平庸也有很大的关系。"""],
            ['吴军',
             """百度从七八年前起，其实基本上已经属于一个僵化的公司了，已经没有希望了。百度的二号人物永远是离职的。很多技术它都是起的大早，
             赶了个晚集。移动互联网时代它完全落伍了，可以讲完全不具有移动互联网的基因，所以做这种转变没有任何意义。说句不好听的，
             已经没有希望了。说句不好听的，陆奇都救不了它，没人救得了它。这家公司已经基本是不属于我们平时关注的对象了。"""]
            ]


